[
  {
    "path": "posts/2022-01-24-biology-capstone-project/",
    "title": "Biology Capstone Project",
    "description": "In the winter semester of 2021, I completed a capstone project about infanticide in primates. Infanticide is known as the act of killing an infanct and is usually committed to gain certain resources or benefits (Brown 1996). There are five main hypotheses that explain infanticide: exploitation, resource competition, parental manipulation, sexual selection, and social pathology. This project included other group members work, but only my posts are shown. My portion focuses on infanticide in three different taxon: prosimians, old world primates, and the great apes.",
    "author": [
      {
        "name": "Isabella Mahmoud",
        "url": {}
      }
    ],
    "date": "2022-01-24",
    "categories": [],
    "contents": "\nInfanticide: A way to get ahead\nAuthor: Isabella Mahmoud Infanticide is an animal behavior commonly reported in primates. There are many hypotheses that surround this behavior, but within primates, the sexual selection hypothesis best explains this phenomenon. Nearly 84 populations of 54 species of primates have been observed to commit infanticide (Zipple et al. 2017). With lactation being longer than gestation in many primate species such as, prosimians, new and old world monkeys, and apes, infanticide has been known to be an evolved, adaptive male reproductive tactic (Beaudrot et al. 2009 and Borries et al. 1999). When males commit infanticide, they derive a fitness benefit by accelerating lactating females to their ovulatory cycle, thus reducing their waiting time for reproductive benefits. The act of infanticide is hard to observe in many species, but well documented studies have reported infanticidal behavior in many primate species. This section will focus on infanticidal behaviors of old world species, prosimians, and the great apes.\n©Japan-guide: Jigokudani Monkey ParkOld World Primates\nAuthor: Isabella Mahmoud\nHanuman langurs (Presbytis entellus) have had the most documented cases of killing infants by adult males and prove to follow the sexual selection hypothesis (Borries et al. 1999). DNA analysis has shown that infants victim to infanticide within Hanuman langurs were not related to their male attacker and the males who killed the infant were fathers of the subsequent offspring . Additionally, females resumed sexual activity earlier to bear their next infant significantly sooner than females with surviving infants. Within all cases studied, Borries et al. (1999) concluded that male attackers did not kill or attack their own kin, but remained residents in their new groups to sire the next infant. Within another study concerning Hanuman langurs, recent immigrants that quickly climbed to a high rank were aggressive towards infants. Most infanticidal incidents occurred in one-male groups due to lack of protection for females and decreased competition that would otherwise be faced within multi-male groups. However, infantide was still noted to occur in multi-male groups whenever there were male shifts in dominance (Borries 1997). Similar to Hanuman langurs, infanticide committed by recent immigrants has been documented in single-male and multi-male social groups of Ursine colobus (Colobus vellerosus) monkeys (Zipple et al. 2017). In most cases of infanticide within primates, immigrant males tend to commit infanticide for their own reproductive gain. Ursine colobus monkeys have no birthing or mating season and their group sizes vary considerably in addition to group composition (multi-male and multi-female groups to uni-male and multi-female groups). As a result of these monkeys mostly staying within their groups, between group encounters are known to be usually aggressive, especially between males. Within Ursine colobus groups, resident males are known to not attack resident infants, while new-immigrant males who achieved high rank did commit infanticide. Like Hanuman langurs, the process of male replacement in C. vellerosus occurs quickly if the attacking male ousts the resident male immediately or occurs gradually as new male(s) immigrate into a group and work their way up in rank (Teichroeb & Sicotte 2008). Teichroeb and Sicotte (2008) found that male immigration was accompanied by high rates of infanticide. Also found within this study was that low-ranking males did not gain any mating access to mothers after their infants died in multi-male groups. Due to not having complete sexual access to the mother, infanticide committed by low-ranking males proved to be non-beneficial. Additionally when in multi-male groups, infanticide could be a risky behavior due to resident males protecting the infants and mate guarding by dominant males (Teichroeb & Sicotte 2008). However, when infanticide did occur amongst Ursine colobus groups, females inter-birth intervals shortened and male attackers were known to mate with the females who lost their infants. Overall, no aggression was seen once the infant was killed or fatally injured. On Yakushima Island in Japan, wild-Japanese macaques (Macaca fuscata) were studied to observe their infanticidal patterns. Like seen in species previously discussed, wild-Japanese macaques behave similarly in terms of infanticidal behavior. Japanese macaques are seasonal breeders, forming multi-male and multi-female social groups with female philopatry and male dispersal. The common trend seen within this species is that male attackers had risen to dominance and killed unweaned infants. 78% of cases of infanticide within this study proved that males had not previously mated with the mothers and DNA had also proved that males did not kill their own offspring (Solitis et al. 2000). Female macaques are also known to have developed counterstrategies against infanticide. Females tend to fight back against their male aggressors, seek protection of males, and mate with multiple males to confuse male paternity. Mating with multiple males can reduce the likelihood that males act aggressively against their offspring. Seasonal breeding can also decrease the risk of infanticide because infant loss is unlikely to shorten interbirth intervals and females will not be able to breed until the next season, even if they did lose their infant (Solitis et al. 2000 and Solanki & Zothansiama 2013). Solitis et al. (2000) found that no mother who lost their infant was observed to mate after infant loss. Infanticide has also been studied and documented in other macaque species such as Maca cyclcpis, M. fascicularis, M. mulatta, M. nestrina, M. silenus, M. sinica, and M. sylvanus (Solanki & Zothansiama 2013).\n©Utah’s Hogle Zoo©New England Primate Conservancy: White-thighed colobus(Colobus vellerosus)©earth.com news©New England Primate Conservancy:Barbary macaque (Macaca sylvanus)Prosimians\nAuthor: Isbaella Mahmoud\nInfanticide has also been documented in prosimians like lemurs. Lemurs are known to be a part of social groups that consist of 8-25 females and males (Pereia & Weiss 1991). Ring-tailed lemurs are known to have males and females commit infanticide. Again, males increase their chances for reproductive success and terminate current fathers reproductive eligibility by killing others’ infants. Males migrate between groups with transfer occurring during the season of lactation. Males tend to attack potential immigrants while females choose immigrants as their potential mates. If interested, females will approach immigrant males non-aggressively with the behinds facing the male. As a result of females approaching immigrants as their potential mates, this causes male attacks against immigrants. As the aggression increases, those immigrant males are known to attack stray infants. When this occurs, females will also become aggressive towards the immigrant males (Pereia & Weiss 1991). Mainly, male immigrants are committing infanticde when there are intergroup encounters. However, there have been few reports of females killing infants as well. Typically, infanticide was committed by high-ranking females who killed subordinate female’s infants due to struggles for dominance or lack of resources (Kittler & Dietzel 2016 and Peria & Weiss 1991). Infanticide within females of ring-tailed lemurs is more seen as collateral damage instead of trying to benefits ones fitness.\n©Smithsonian’s National Zoo and Conservation Biology InstituteThe Great Apes\nAuthor: Isabella Mahmoud\nThe Great Apes contain species that tend to have different infanticidal patterns than their old world, prosimians, and new world relatives. Mountain gorillas in Virunga Volcano regions typically live in multi-male or uni-male groups and infanticide usually occurs during transistions of power or group disintegrations (Robbins et al. 2013). Group disintegrations occur when the dominant male dies in a one-male group. Similar to their relatives, infanticde typically shortens the interbirth interval until next ovulation in a female. It has proven to be beneficial for a female to live in multi-male groups due to having multiple males serving as protection for the mother and her infant. Robbins et al. (2013) found that 57.1% probability of getting killed in one-male groups while there is a 6% probability in multi-male groups. Additionally, infanticide accounted for 21% of infant mortality. Similar to the wild-Japanese macaques, female mountain gorillas developed counterstrategies to male infanticide which mainly includes multi-male mating. Males will not kill their own offspring. Infanticidal behavior with chimpanzees (Pan troglodytes) is infrequent, but can be highly selective. The norm for chimpanzees is not to harm infants and they typically react emotionally when norms are violated. Even though infants rarely become victims of severe aggression in the form of inter and intra community infanticide, infanticide can still occur (Rudolph von Rohr et al. 2015). With the trend of infanticide in other species being mostly committed by males, there is stronger evidence of female infanticide in chimpanzees. Mothers do not kill their own kin, but instead, kill those that they see as potential threats (Pusey & Schroepfer-Walker 2013). Female chimpanzees are known to have slow rates of reproduction and raise offspring without direct paternal care. Their reproductive success depends on long-term access to high-quality food resources over their lifespan (Pusey & Schroepfer-Walker 2013). They tend to live in communities that contain multiple adult males, multiple females, and infants. Within those communities, individuals may spend time alone or in subgroups whose size depends mostly on abundance and distribution of food. In order to avoid direct competition, females may forage alone or in small groups with high fidelity. Aggression rates are usually low, but females are known to compete for space and access to food (Pusey & Schroepfer-Walker 2013). Pusey & Schroepfer-Walker (2013) focused on monitoring female competition in chimpanzees and documented whether infanticidal behavior occurred. Overall, adult female chimpanzees were aggressive to immigrant females and even killed newborn infants as a result of their aggression. Since females reproduce every 5-7 years for roughly 35-45 years, the intensity of their aggression correlates with population density and competition for resources (Pusey & Schroepfer-Walker 2013). Reproduction is accelerated by access to food, so food access influences reproductive rates. During low food availability, females will tend to avoid others; however, when new immigrants are trying to settle within core areas, females will try to drive out the immigrant in any way she can. Resident females will even become infanticidal in order to remove future feeding competitors for themselves and their future offspring. Overall, infanticide is not the result of general aggression between female chimpanzees, but occurs due to individual interest (Rudolph von Rohr et al. 2015). Orangutans are a different story. With females interbirth intervals lasting 7.6 years and living predominately alone, it is expected for males to employ infanticide (Beaudrot et al. 2009 and Scott et al. 2019). However, no infanticides in wild orangutans have been reported in both Pongo abelii or Pongo pygmaeus. According to Wich et al. within a 2004 study, infant mortality in the first year of life for gorillas is 26% and for chimpanzees, it’s 20%. For orangutans, it’s 8%, which is higher than any other survival rate of the great apes. Gorillas and chimpanzees are known to have infanticidal behaviors. There has been a report of a captive Bornean male killing his own infant shortly after birth, but again, no evidence has been found within the wild. In order to come to any conclusions regarding infanticide in orangutans, it’s important to explore all options. If it cannot be observed, then female counter strategies have to be considered. If they exist, then there is evidence that infanticide may occur. Beaudrot et al. (2009) found that when observing Bornean and Sumatran orangutans, there was no evidence of aggression by mothers against strangers or over territory. It appeared that infanticide was of little concern to females due to orangutans not being a territorial species or having reactions to strangers. Female orangutans are known to be a bit promiscuous with having multiple mates, which is a counter strategy for infanticide. However, that was the only evidence that could have supported infanticde. Scott et al. (2019) noticed that females with offspring less than six years old tended to encounter males less than those with offspring greater than six years old. This could be seen as a fear of males around their young offspring or could support that there is an increase in mating efforts by males and females towards the end of that female interbirth interval. Additionally, it was also noted that the distance between mother and offspring increased with age, but always decreased in the presence of males. Are males seen as a threat? Unfortunately with lack of evidence and high infant survival rates, infanticidal behavior cannot be confirmed within orangutans.\n©Smithsonian Magazine: An infant mountain gorilla from the Katwe group in Bwinidi Impenetrable National Park, Uganda©WWF©Britannica: Adult chimpanzees with offspring©Britannica: A male orangutan looks down from the branches of a treePrimate Infanticide\nAuthor: Isabella Mahmoud\nAcross many species and taxon of primate, infanticide is known to occur. Within many old world species, infanticide is commonly committed by males in order to increase their reproductive fitness by shortening the interbirth intervals of lactating females. Ring-tailed lemurs of the prosimian taxa reside in female-led groups. These females are known to kill immigrant infants when resources are low due to resource competition for them and their future offspring. The great apes have a mix of infanticidal behaviors. Male mountain gorillas become infanticidal during a change of power, but female chimpanzees become infanticidal when immigrant females are encountered during times of low resources. In terms of orangutans, infanticidal behavior cannot be confirmed or denied. There are many pieces of evidence to support either argument. Overall, the common themes seen between species and taxon is that two forms of infanticide can occur: male and female infanticide. Males may kill to increase their reproductive fitness while females kill to make sure they have enough resources for themselves and future offspring. However, the common trend between primates is that they mostly do not kill their own kin.\n©National Geographic\n\n\n",
    "preview": {},
    "last_modified": "2022-01-24T23:31:51+00:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-01-24-project-visuals/",
    "title": "Project Visuals",
    "description": "During the fall semester of 2021, I completed an introductory R course. This post includes graphs and visuals using my final project dataset. The [dataset](https://osf.io/kthnf/) was last updated in October of 2020 and focuses on pregnancies, births, and abortions in the United States for the years 1973-2017. This dataset was compiled and analyzed by Isaac Maddow-Zimet, Kathryn Kost, and Sean Finn. Within my project, I focused on pregancy rates from 2000-2017 for four different age groups: 20-24, 25-29, 30-34, and 35-39.",
    "author": [
      {
        "name": "Isabella Mahmoud",
        "url": {}
      }
    ],
    "date": "2022-01-24",
    "categories": [],
    "contents": "\n\n\nlibrary(tidyverse)\nlibrary(gt)\nlibrary(janitor)\nlibrary(ggplot2)\nlibrary(readr)\nBirth <- read_csv(\"~/STA 518/Activities/Final Mess Around/NationalAndStatePregnancy_PublicUse.csv\")\n\n\n\nThis chunk is filtering the data to what is being focused on in this project.\n\n\nBirth2 <- Birth %>%\n  select(\"state\", \"year\", \"pregnancyrate2024\":\"pregnancyrate3539\") %>%\n  filter(year >=2000, state !=\"US\" & state != \"DC\")\nBirth2\n\n\n# A tibble: 700 x 6\n   state  year pregnancyrate2024 pregnancyrate2529 pregnancyrate3034\n   <chr> <dbl>             <dbl>             <dbl>             <dbl>\n 1 AL     2000              187.              159.              96.1\n 2 AL     2005              166.              155.             100. \n 3 AL     2006              172.              159.             101. \n 4 AL     2007              175.              161.             104. \n 5 AL     2008              171.              161.             104. \n 6 AL     2009              161.              155.             104. \n 7 AL     2010              149.              152.             102. \n 8 AL     2011              143.              150.             103. \n 9 AL     2012              135.              148              104. \n10 AL     2013              135.              148.             104. \n# … with 690 more rows, and 1 more variable: pregnancyrate3539 <dbl>\n\nThis code creates a bar graph displaying the pregnancy rates for all age groups for the year 2000.\n\n\nBir <- Birth2 %>%\n  filter(year==2000) %>%\n  pivot_longer(c(\"pregnancyrate2024\":\"pregnancyrate3539\"), names_to = \"Groups\", values_to = \"Rates\") %>%\n  group_by(Groups, year) %>%\n  summarise(Rate_Avg = mean(Rates)) %>%\n  ggplot() +\n  geom_col(aes(x=Groups, y=Rate_Avg, fill=Groups)) +\n  scale_x_discrete(labels=c(\"20-24\", \"25-29\", \"30-34\", \"35-39\")) +\n  labs(x = \"Age groups\",\n       y= \"Average pregnancy rates\",\n       title = \"Average pregnancy rates by age for the year 2000 in the United States\",\n       caption = \"*Rates are per 1,000 women\",\n       tag = \"Fig. 1\")  +\n  theme(axis.text.x = element_text(angle = 60, size=12, hjust = 1))\nBir\n\n\n\n\nThe code chunk creates a bar graph for the year 2017 for average pregnancy rates among all age groups.\n\n\nBir2 <- Birth2 %>%\n  filter(year==2017) %>%\n  pivot_longer(c(\"pregnancyrate2024\":\"pregnancyrate3539\"), names_to = \"Groups\", values_to = \"Rates\") %>%\n  group_by(Groups, year) %>%\n  summarise(Rate_Avg = mean(Rates)) %>%\nggplot() +\n  geom_col(aes(x=Groups, y=Rate_Avg, fill=Groups)) +\n  scale_x_discrete(labels=c(\"20-24\", \"25-29\", \"30-34\", \"35-39\")) +\n  labs(x = \"Age groups\",\n       y= \" Average pregnancy rates\",\n       title = \"Average pregnancy rates by age for the year 2017 in the United States\",\n       caption = \"*Rates are per 1,000 women\",\n       tag = \"Fig. 2\") +\n  theme(axis.text.x = element_text(angle = 60, size=12, hjust = 1))\nBir2\n\n\n\n\nIn order to create a linge graph displaying the birth rates for each year for each age group, I had to use the pivot_longer function. This allowed me to attach rates to different age groups per year. Once grouping by groups and year, I used “summarise” to get an average rate. Doing this made it so I could graph group averages per year over a 17 year period.\n\n\nBir3 <- Birth2 %>%\n    pivot_longer(c(\"pregnancyrate2024\":\"pregnancyrate3539\"), names_to = \"Groups\", values_to = \"Rates\") %>%\n    group_by(Groups, year) %>%\n    summarise(Rate_Avg = mean(Rates)) %>%\n    ggplot(mapping = aes(x = year, y = Rate_Avg, color = Groups)) + \n    geom_point()+\n    geom_line() +\n  labs(x = \"Year\",\n       y= \"Average pregnancy rates\",\n       title = \"Average pregnancy rates by year in the United States from 2000-2017\",\n       caption = \"*Rates are per 1,000 women\",\n       tag = \"Fig. 3\")\nBir3\n\n\n\n\nThis next part is looking at abortion rates for 20-24 year olds in Illinois over 17 years. Since I’m from Illinois and within this age group, I thought this data would be most relevant/interesting to me.\n\n\nrib <- Birth %>%\n  select(\"state\", \"year\", \"abortionrate2024\") %>%\n  filter(year >=2000, state == \"IL\") %>%\n  pivot_longer(c(\"abortionrate2024\"), names_to = \"Groups\", values_to = \"Rates\")\nrib\n\n\n# A tibble: 14 x 4\n   state  year Groups           Rates\n   <chr> <dbl> <chr>            <dbl>\n 1 IL     2000 abortionrate2024  45.4\n 2 IL     2005 abortionrate2024  34.4\n 3 IL     2006 abortionrate2024  34.8\n 4 IL     2007 abortionrate2024  34.2\n 5 IL     2008 abortionrate2024  37.4\n 6 IL     2009 abortionrate2024  33.6\n 7 IL     2010 abortionrate2024  30.4\n 8 IL     2011 abortionrate2024  30.6\n 9 IL     2012 abortionrate2024  29.9\n10 IL     2013 abortionrate2024  29.5\n11 IL     2014 abortionrate2024  29  \n12 IL     2015 abortionrate2024  27.6\n13 IL     2016 abortionrate2024  26.7\n14 IL     2017 abortionrate2024  27.2\n\nThis chunk creates a line graph for the code chunk above.\n\n\nrib %>%\n  ggplot(mapping=aes( x=year, y=Rates)) +\n    geom_point() +\n    geom_smooth(method=lm, se=F) +\n   labs(x = \"Year\",\n       y= \"Average abortion rates\",\n       title = \"Average abortion rates for 20-24 year olds per year in Illinois from 2000-2017\",\n       caption = \"*Rates are per 1,000 women\",\n       tag = \"Fig. 4\")\n\n\n\n\nA model is made based off the simple linear regression created above. Broom::tidy focuses on specific statistics, such as the coefficents for the intercept and predictor, standard error, test statistic, and p-value.\n\n\nmodel <- lm(Rates ~ year, data=rib)\nsummary(model)\n\n\n\nCall:\nlm(formula = Rates ~ year, data = rib)\n\nResiduals:\n    Min      1Q  Median      3Q     Max \n-2.9172 -1.0689  0.0775  0.4491  3.1691 \n\nCoefficients:\n             Estimate Std. Error t value Pr(>|t|)    \n(Intercept) 2007.7247   212.7956   9.435 6.69e-07 ***\nyear          -0.9827     0.1059  -9.284 7.95e-07 ***\n---\nSignif. codes:  0 '***' 0.001 '**' 0.01 '*' 0.05 '.' 0.1 ' ' 1\n\nResidual standard error: 1.816 on 12 degrees of freedom\nMultiple R-squared:  0.8778,    Adjusted R-squared:  0.8676 \nF-statistic: 86.19 on 1 and 12 DF,  p-value: 7.946e-07\n\n#this will make things look nicer\nmodel %>% \n  broom::tidy()\n\n\n# A tibble: 2 x 5\n  term        estimate std.error statistic     p.value\n  <chr>          <dbl>     <dbl>     <dbl>       <dbl>\n1 (Intercept) 2008.      213.         9.43 0.000000669\n2 year          -0.983     0.106     -9.28 0.000000795\n\n\n\n\n",
    "preview": "posts/2022-01-24-project-visuals/project-visuals_files/figure-html5/unnamed-chunk-3-1.png",
    "last_modified": "2022-01-24T23:26:52+00:00",
    "input_file": {}
  }
]
